apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spi.c
#ifdef CONFIG_ESP32S3_SPI2
static const struct esp32s3_spi_config_s esp32s3_spi2_config =
{
  .clk_freq     = SPI_DEFAULT_FREQ,
  .width        = SPI_DEFAULT_WIDTH,
  .id           = 2,
  .mode         = SPI_DEFAULT_MODE,
  .cs_pin       = CONFIG_ESP32S3_SPI2_CSPIN,
  .mosi_pin     = CONFIG_ESP32S3_SPI2_MOSIPIN,
  .miso_pin     = CONFIG_ESP32S3_SPI2_MISOPIN,
  .clk_pin      = CONFIG_ESP32S3_SPI2_CLKPIN,
#ifdef CONFIG_ESP32S3_SPI_DMA
  .periph       = ESP32S3_PERIPH_SPI2,
  .irq          = ESP32S3_IRQ_SPI2,
#endif
  .clk_bit      = SYSTEM_SPI2_CLK_EN,
  .rst_bit      = SYSTEM_SPI2_RST,
#ifdef CONFIG_ESP32S3_SPI_DMA
  .dma_clk_bit  = SYSTEM_SPI2_DMA_CLK_EN,
  .dma_rst_bit  = SYSTEM_SPI2_DMA_RST,
  .dma_periph   = ESP32S3_DMA_PERIPH_SPI2,
#endif
  .cs_insig     = FSPICS0_IN_IDX,
  .cs_outsig    = FSPICS0_OUT_IDX,
  .mosi_insig   = FSPID_IN_IDX,
  .mosi_outsig  = FSPID_OUT_IDX,
  .miso_insig   = FSPIQ_IN_IDX,
  .miso_outsig  = FSPIQ_OUT_IDX,
  .clk_insig    = FSPICLK_IN_IDX,
  .clk_outsig   = FSPICLK_OUT_IDX
};

static const struct spi_ops_s esp32s3_spi2_ops =
{
  .lock              = esp32s3_spi_lock,
#ifdef CONFIG_ESP32S3_SPI_UDCS
  .select            = esp32s3_spi2_select,
#else
  .select            = esp32s3_spi_select,
#endif
  .setfrequency      = esp32s3_spi_setfrequency,
  .setmode           = esp32s3_spi_setmode,
  .setbits           = esp32s3_spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = esp32s3_spi_hwfeatures,
#endif
  .status            = esp32s3_spi2_status,
#ifdef CONFIG_SPI_CMDDATA
  .cmddata           = esp32s3_spi2_cmddata,
#endif
  .send              = esp32s3_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = esp32s3_spi_exchange,
#else
  .sndblock          = esp32s3_spi_sndblock,
  .recvblock         = esp32s3_spi_recvblock,
#endif
#ifdef CONFIG_SPI_TRIGGER
  .trigger           = esp32s3_spi_trigger,
#endif
  .registercallback  = NULL,
};

#ifdef CONFIG_ESP32S3_SPI_DMA

/* SPI DMA RX/TX description */

static struct esp32s3_dmadesc_s esp32s3_spi2_dma_txdesc[SPI_DMA_DESC_NUM];
static struct esp32s3_dmadesc_s esp32s3_spi2_dma_rxdesc[SPI_DMA_DESC_NUM];

#endif

static struct esp32s3_spi_priv_s esp32s3_spi2_priv =
{
  .spi_dev     =
    {
      .ops     = &esp32s3_spi2_ops
    },
  .config      = &esp32s3_spi2_config,
  .refs        = 0,
  .lock        = NXMUTEX_INITIALIZER,
#ifdef CONFIG_ESP32S3_SPI_DMA
  .sem_isr     = SEM_INITIALIZER(0),
  .cpuint      = -ENOMEM,
  .dma_channel = -1,
  .dma_rxdesc  = esp32s3_spi2_dma_rxdesc,
  .dma_txdesc  = esp32s3_spi2_dma_txdesc,
#endif
  .frequency   = 0,
  .actual      = 0,
  .mode        = 0,
  .nbits       = 0
};
#endif /* CONFIG_ESP32S3_SPI2 */

#ifdef CONFIG_ESP32S3_SPI3
static const struct esp32s3_spi_config_s esp32s3_spi3_config =
{
  .clk_freq     = SPI_DEFAULT_FREQ,
  .width        = SPI_DEFAULT_WIDTH,
  .id           = 3,
  .mode         = SPI_DEFAULT_MODE,
  .cs_pin       = CONFIG_ESP32S3_SPI3_CSPIN,
  .mosi_pin     = CONFIG_ESP32S3_SPI3_MOSIPIN,
  .miso_pin     = CONFIG_ESP32S3_SPI3_MISOPIN,
  .clk_pin      = CONFIG_ESP32S3_SPI3_CLKPIN,
#ifdef CONFIG_ESP32S3_SPI_DMA
  .periph       = ESP32S3_PERIPH_SPI3,
  .irq          = ESP32S3_IRQ_SPI3,
#endif
  .clk_bit      = SYSTEM_SPI3_CLK_EN,
  .rst_bit      = SYSTEM_SPI3_RST,
#ifdef CONFIG_ESP32S3_SPI_DMA
  .dma_clk_bit  = SYSTEM_SPI3_DMA_CLK_EN,
  .dma_rst_bit  = SYSTEM_SPI3_DMA_RST,
  .dma_periph   = ESP32S3_DMA_PERIPH_SPI3,
#endif
  .cs_insig     = SPI3_CS0_IN_IDX,
  .cs_outsig    = SPI3_CS0_OUT_IDX,
  .mosi_insig   = SPI3_D_IN_IDX,
  .mosi_outsig  = SPI3_D_OUT_IDX,
  .miso_insig   = SPI3_Q_IN_IDX,
  .miso_outsig  = SPI3_Q_OUT_IDX,
  .clk_insig    = SPI3_CLK_IN_IDX,
  .clk_outsig   = SPI3_CLK_OUT_IDX
};

static const struct spi_ops_s esp32s3_spi3_ops =
{
  .lock              = esp32s3_spi_lock,
#ifdef CONFIG_ESP32S3_SPI_UDCS
  .select            = esp32s3_spi3_select,
#else
  .select            = esp32s3_spi_select,
#endif
  .setfrequency      = esp32s3_spi_setfrequency,
  .setmode           = esp32s3_spi_setmode,
  .setbits           = esp32s3_spi_setbits,
#ifdef CONFIG_SPI_HWFEATURES
  .hwfeatures        = esp32s3_spi_hwfeatures,
#endif
  .status            = esp32s3_spi3_status,
#ifdef CONFIG_SPI_CMDDATA
  .cmddata           = esp32s3_spi3_cmddata,
#endif
  .send              = esp32s3_spi_send,
#ifdef CONFIG_SPI_EXCHANGE
  .exchange          = esp32s3_spi_exchange,
#else
  .sndblock          = esp32s3_spi_sndblock,
  .recvblock         = esp32s3_spi_recvblock,
#endif
#ifdef CONFIG_SPI_TRIGGER
  .trigger           = esp32s3_spi_trigger,
#endif
  .registercallback  = NULL,
};

#ifdef CONFIG_ESP32S3_SPI_DMA

/* SPI DMA RX/TX description */

static struct esp32s3_dmadesc_s esp32s3_spi3_dma_txdesc[SPI_DMA_DESC_NUM];
static struct esp32s3_dmadesc_s esp32s3_spi3_dma_rxdesc[SPI_DMA_DESC_NUM];

#endif

static struct esp32s3_spi_priv_s esp32s3_spi3_priv =
{
  .spi_dev     =
    {
      .ops     = &esp32s3_spi3_ops
    },
  .config      = &esp32s3_spi3_config,
  .refs        = 0,
  .lock        = NXMUTEX_INITIALIZER,
#ifdef CONFIG_ESP32S3_SPI_DMA
  .sem_isr     = SEM_INITIALIZER(0),
  .cpuint      = -ENOMEM,
  .dma_channel = -1,
  .dma_rxdesc  = esp32s3_spi3_dma_rxdesc,
  .dma_txdesc  = esp32s3_spi3_dma_txdesc,
#endif
  .frequency   = 0,
  .actual      = 0,
  .mode        = 0,
  .nbits       = 0
};
#endif /* CONFIG_ESP32S3_SPI3 */

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s3_spi_set_regbits
 *
 * Description:
 *   Set the bits of the SPI register.
 *
 * Input Parameters:
 *   addr - Address of the register of interest
 *   bits - Bits to be set
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void esp32s3_spi_set_regbits(uint32_t addr, uint32_t bits)
{
  uint32_t tmp = getreg32(addr);

  putreg32(tmp | bits, addr);
}

/****************************************************************************
 * Name: esp32s3_spi_clr_regbits
 *
 * Description:
 *   Clear the bits of the SPI register.
 *
 * Input Parameters:
 *   addr - Address of the register of interest
 *   bits - Bits to be cleared
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void esp32s3_spi_clr_regbits(uint32_t addr, uint32_t bits)
{
  uint32_t tmp = getreg32(addr);

  putreg32(tmp & ~bits, addr);
}

/****************************************************************************
 * Name: esp32s3_spi_iomux
 *
 * Description:
 *   Check if the option SPI GPIO pins can use IOMUX directly
 *
 * Input Parameters:
 *   priv   - Private SPI device structure
 *
 * Returned Value:
 *   True if can use IOMUX or false if can't.
 *
 ****************************************************************************/

static inline bool esp32s3_spi_iomux(struct esp32s3_spi_priv_s *priv)
{
  bool mapped = false;
  const struct esp32s3_spi_config_s *cfg = priv->config;

  /* We only need to check SPI2, SPI3 doesn't support IOMUX */

