apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spi.c
          esp32s3_dma_setup(priv->dma_rxdesc, SPI_DMA_DESC_NUM,
                            rp, bytes, false, priv->dma_channel);
          esp32s3_dma_load(priv->dma_rxdesc, channel, false);
          esp32s3_dma_enable(channel, false);

          esp32s3_spi_set_regbits(SPI_USER_REG(priv->config->id),
                                  SPI_USR_MISO_M);

          rp += n;
        }
      else
        {
          esp32s3_spi_clr_regbits(SPI_USER_REG(priv->config->id),
                                  SPI_USR_MISO_M);
        }

      /* Trigger start of user-defined transaction for master. */

      esp32s3_spi_set_regbits(SPI_CMD_REG(priv->config->id),
                              SPI_UPDATE_M);

      while ((getreg32(SPI_CMD_REG(priv->config->id)) & SPI_UPDATE_M) != 0)
        {
          ;
        }

      esp32s3_spi_set_regbits(SPI_CMD_REG(priv->config->id), SPI_USR_M);

      esp32s3_spi_sem_waitdone(priv);

      bytes -= n;
    }

  esp32s3_spi_clr_regbits(SPI_DMA_INT_ENA_REG(priv->config->id),
                          SPI_TRANS_DONE_INT_ENA_M);
}
#endif

/****************************************************************************
 * Name: esp32s3_spi_poll_send
 *
 * Description:
 *   Send one word on SPI by polling mode.
 *
 * Input Parameters:
 *   priv - SPI private state data
 *   wd   - The word to send. The size of the data is determined by the
 *          number of bits selected for the SPI interface.
 *
 * Returned Value:
 *   Received value.
 *
 ****************************************************************************/

static uint32_t esp32s3_spi_poll_send(struct esp32s3_spi_priv_s *priv,
                                      uint32_t wd)
{
#ifdef CONFIG_ESP32S3_SPI_DMA
  esp32s3_spi_clr_regbits(SPI_DMA_CONF_REG(priv->config->id),
                          SPI_DMA_TX_ENA_M);

  esp32s3_spi_clr_regbits(SPI_DMA_CONF_REG(priv->config->id),
                          SPI_DMA_RX_ENA_M);
#endif

  uint32_t val;

  putreg32((priv->nbits - 1), SPI_MS_DLEN_REG(priv->config->id));

  putreg32(wd, SPI_W0_REG(priv->config->id));

  /* Trigger start of user-defined transaction for master. */

  esp32s3_spi_set_regbits(SPI_CMD_REG(priv->config->id), SPI_UPDATE_M);

  while ((getreg32(SPI_CMD_REG(priv->config->id)) & SPI_UPDATE_M) != 0)
    {
      ;
    }

  esp32s3_spi_set_regbits(SPI_CMD_REG(priv->config->id), SPI_USR_M);

  /* Wait for the user-defined transaction to finish. */

  while ((getreg32(SPI_CMD_REG(priv->config->id)) & SPI_USR_M) != 0)
    {
      ;
    }

  val = getreg32(SPI_W0_REG(priv->config->id));

  spiinfo("send=0x%" PRIx32 " and recv=0x%" PRIx32 "\n", wd, val);

  return val;
}

/****************************************************************************
 * Name: esp32s3_spi_send
 *
 * Description:
 *   Send one word on SPI.
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *   wd  - The word to send. The size of the data is determined by the
 *         number of bits selected for the SPI interface.
 *
 * Returned Value:
 *   Received value.
 *
 ****************************************************************************/

static uint32_t esp32s3_spi_send(struct spi_dev_s *dev, uint32_t wd)
{
  struct esp32s3_spi_priv_s *priv = (struct esp32s3_spi_priv_s *)dev;

  return esp32s3_spi_poll_send(priv, wd);
}

/****************************************************************************
 * Name: esp32s3_spi_poll_exchange
 *
 * Description:
 *   Exchange a block of data from SPI.
 *
 * Input Parameters:
 *   priv     - SPI private state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nwords   - The length of data that to be exchanged in units of words.
 *              The wordsize is determined by the number of bits-per-word
 *              selected for the SPI interface. If nbits <= 8, the data is
 *              packed into uint8_t's; if nbits >8, the data is packed into
 *              uint16_t's
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32s3_spi_poll_exchange(struct esp32s3_spi_priv_s *priv,
                                      const void *txbuffer,
                                      void *rxbuffer,
                                      size_t nwords)
{
#ifdef CONFIG_ESP32S3_SPI_DMA
  esp32s3_spi_clr_regbits(SPI_DMA_CONF_REG(priv->config->id),
                          SPI_DMA_TX_ENA_M);

  esp32s3_spi_clr_regbits(SPI_DMA_CONF_REG(priv->config->id),
                          SPI_DMA_RX_ENA_M);
#endif

  const uint32_t total_bytes = nwords * (priv->nbits / 8);
  uintptr_t bytes_remaining = total_bytes;
  const uint8_t *tp = (const uint8_t *)txbuffer;
  uint8_t *rp = (uint8_t *)rxbuffer;

  while (bytes_remaining != 0)
    {
      /* Initialize data_buf_reg with the address of the first data buffer
       * register (W0).
       */

      uintptr_t data_buf_reg = SPI_W0_REG(priv->config->id);
      uint32_t transfer_size = MIN(SPI_MAX_BUF_SIZE, bytes_remaining);

      /* Write data words to data buffer registers.
       * SPI peripheral contains 16 registers (W0 - W15).
       */

      for (int i = 0 ; i < transfer_size; i += sizeof(uintptr_t))
        {
          uint32_t w_wd = UINT32_MAX;

          if (tp != NULL)
            {
              memcpy(&w_wd, tp, sizeof(uintptr_t));

              tp += sizeof(uintptr_t);
            }

          putreg32(w_wd, data_buf_reg);

          spiinfo("send=0x%" PRIx32 " data_reg=0x%" PRIxPTR "\n",
                  w_wd, data_buf_reg);

          /* Update data_buf_reg to point to the next data buffer register. */

          data_buf_reg += sizeof(uintptr_t);
        }

      esp32s3_spi_set_regbits(SPI_USER_REG(priv->config->id),
                              SPI_USR_MOSI_M);

      if (rp == NULL)
        {
          esp32s3_spi_clr_regbits(SPI_USER_REG(priv->config->id),
                                  SPI_USR_MISO_M);
        }
      else
        {
          esp32s3_spi_set_regbits(SPI_USER_REG(priv->config->id),
                                  SPI_USR_MISO_M);
        }

      putreg32((transfer_size * 8) - 1,
               SPI_MS_DLEN_REG(priv->config->id));

      /* Trigger start of user-defined transaction for master. */

      esp32s3_spi_set_regbits(SPI_CMD_REG(priv->config->id),
                              SPI_UPDATE_M);

      while ((getreg32(SPI_CMD_REG(priv->config->id)) & SPI_UPDATE_M) != 0)
        {
          ;
        }

      esp32s3_spi_set_regbits(SPI_CMD_REG(priv->config->id), SPI_USR_M);

      /* Wait for the user-defined transaction to finish. */

      while ((getreg32(SPI_CMD_REG(priv->config->id)) & SPI_USR_M) != 0)
        {
          ;
        }

      if (rp != NULL)
        {
          /* Set data_buf_reg with the address of the first data buffer
           * register (W0).
           */

          data_buf_reg = SPI_W0_REG(priv->config->id);

          /* Read received data words from SPI data buffer registers. */

          for (int i = 0 ; i < transfer_size; i += sizeof(uintptr_t))
            {
              uint32_t r_wd = getreg32(data_buf_reg);

              spiinfo("recv=0x%" PRIx32 " data_reg=0x%" PRIxPTR "\n",
                      r_wd, data_buf_reg);

              memcpy(rp, &r_wd, sizeof(uintptr_t));

              rp += sizeof(uintptr_t);

              /* Update data_buf_reg to point to the next data buffer
               * register.
               */

              data_buf_reg += sizeof(uintptr_t);
            }
        }

      bytes_remaining -= transfer_size;
    }
}

/****************************************************************************
 * Name: esp32s3_spi_exchange
 *
 * Description:
 *   Exchange a block of data from SPI.
 *
 * Input Parameters:
 *   dev      - Device-specific state data
 *   txbuffer - A pointer to the buffer of data to be sent
 *   rxbuffer - A pointer to the buffer in which to receive data
 *   nwords   - The length of data that to be exchanged in units of words.
 *              The wordsize is determined by the number of bits-per-word
 *              selected for the SPI interface. If nbits <= 8, the data is
 *              packed into uint8_t's; if nbits >8, the data is packed into
 *              uint16_t's
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32s3_spi_exchange(struct spi_dev_s *dev,
                                 const void *txbuffer,
                                 void *rxbuffer,
                                 size_t nwords)
{
  struct esp32s3_spi_priv_s *priv = (struct esp32s3_spi_priv_s *)dev;

