apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spi.c
  esp_gpiowrite(config->clk_pin, true);

#if SPI_HAVE_SWCS
  if (config->cs_pin >= 0)
    {
      esp_configgpio(config->cs_pin, OUTPUT_FUNCTION_1);
      esp_gpio_matrix_out(config->cs_pin, SIG_GPIO_OUT_IDX, 0, 0);
    }
#ifdef CONFIG_ESP32S3_SPI_UDCS
#ifdef CONFIG_ESP32S3_SPI2
  else if (config->id == ESP32S3_SPI2)
    {
      esp32s3_spi2_select(dev, config->id, false);
    }
#endif
#ifdef CONFIG_ESP32S3_SPI3
  else if (config->id == ESP32S3_SPI3)
    {
      esp32s3_spi3_select(dev, config->id, false);
    }
#endif
#endif
#endif

  /* SPI3 doesn't have IOMUX, if SPI3 is enabled use GPIO Matrix for both */

  if (esp32s3_spi_iomux(priv))
    {
#if !SPI_HAVE_SWCS
      if (config->cs_pin >= 0)
        {
          esp_configgpio(config->cs_pin, OUTPUT_FUNCTION_5);
          esp_gpio_matrix_out(config->cs_pin, SIG_GPIO_OUT_IDX, 0, 0);
        }
#endif

      if (config->mosi_pin >= 0)
        {
          esp_configgpio(config->mosi_pin, OUTPUT_FUNCTION_5);
          esp_gpio_matrix_out(config->mosi_pin, SIG_GPIO_OUT_IDX, 0, 0);
        }

      if (config->miso_pin >= 0)
        {
          esp_configgpio(config->miso_pin, INPUT_FUNCTION_5 | PULLUP);
          esp_gpio_matrix_out(config->miso_pin, SIG_GPIO_OUT_IDX, 0, 0);
        }

      esp_configgpio(config->clk_pin, OUTPUT_FUNCTION_5);
      esp_gpio_matrix_out(config->clk_pin, SIG_GPIO_OUT_IDX, 0, 0);
    }
  else
    {
#if !SPI_HAVE_SWCS
      if (config->cs_pin >= 0)
        {
          esp_configgpio(config->cs_pin, OUTPUT);
          esp_gpio_matrix_out(config->cs_pin, config->cs_outsig, 0, 0);
        }
#endif

      if (config->mosi_pin >= 0)
        {
          esp_configgpio(config->mosi_pin, OUTPUT);
          esp_gpio_matrix_out(config->mosi_pin,
                                  config->mosi_outsig, 0, 0);
        }

      if (config->miso_pin >= 0)
        {
          esp_configgpio(config->miso_pin, INPUT | PULLUP);
          esp_gpio_matrix_in(config->miso_pin, config->miso_insig, 0);
        }

      esp_configgpio(config->clk_pin, OUTPUT);
      esp_gpio_matrix_out(config->clk_pin, config->clk_outsig, 0, 0);
    }

  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, 0, config->clk_bit);
  modifyreg32(SYSTEM_PERIP_RST_EN0_REG, config->rst_bit, 0);

  regval = SPI_DOUTDIN_M | SPI_USR_MISO_M | SPI_USR_MOSI_M | SPI_CS_HOLD_M;
  putreg32(regval, SPI_USER_REG(priv->config->id));
  putreg32(0, SPI_USER1_REG(priv->config->id));
  putreg32(0, SPI_SLAVE_REG(priv->config->id));
  putreg32(SPI_CS1_DIS_M | SPI_CS2_DIS_M,
           SPI_MISC_REG(priv->config->id));

  regval = SPI_CLK_EN_M | SPI_MST_CLK_ACTIVE_M | SPI_MST_CLK_SEL_M;
  putreg32(regval, SPI_CLK_GATE_REG(priv->config->id));

#if SPI_HAVE_SWCS
  esp32s3_spi_set_regbits(SPI_MISC_REG(priv->config->id), SPI_CS0_DIS_M);
#endif

  putreg32(0, SPI_CTRL_REG(priv->config->id));
  putreg32(VALUE_MASK(0, SPI_CS_HOLD_TIME),
           SPI_USER1_REG(priv->config->id));

#ifdef CONFIG_ESP32S3_SPI_DMA
  if (esp32s3_spi_dma_init(dev) != OK)
    {
      modifyreg32(SYSTEM_PERIP_RST_EN0_REG, 0, priv->config->clk_bit);
      modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, priv->config->clk_bit, 0);
      return ERROR;
    }
#endif

  esp32s3_spi_setfrequency(dev, config->clk_freq);
  esp32s3_spi_setbits(dev, config->width);
  esp32s3_spi_setmode(dev, config->mode);

  return OK;
}

/****************************************************************************
 * Name: esp32s3_spi_deinit
 *
 * Description:
 *   Deinitialize ESP32-S3 SPI hardware interface.
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void esp32s3_spi_deinit(struct spi_dev_s *dev)
{
  struct esp32s3_spi_priv_s *priv = (struct esp32s3_spi_priv_s *)dev;

#ifdef CONFIG_ESP32S3_SPI_DMA
  esp32s3_spi_dma_deinit(dev);
#endif

  modifyreg32(SYSTEM_PERIP_RST_EN0_REG, 0, priv->config->clk_bit);
  modifyreg32(SYSTEM_PERIP_CLK_EN0_REG, priv->config->clk_bit, 0);

  priv->frequency = 0;
  priv->actual    = 0;
  priv->mode      = SPIDEV_MODE0;
  priv->nbits     = 0;
}

/****************************************************************************
 * Name: esp32s3_spi_interrupt
 *
 * Description:
 *   Common SPI DMA interrupt handler.
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info
 *   arg     - SPI controller private data
 *
 * Returned Value:
 *   Standard interrupt return value.
 *
 ****************************************************************************/

#ifdef CONFIG_ESP32S3_SPI_DMA
static int esp32s3_spi_interrupt(int irq, void *context, void *arg)
{
  struct esp32s3_spi_priv_s *priv = (struct esp32s3_spi_priv_s *)arg;

  /* Write 1 to clear interrupt bit */

  esp32s3_spi_set_regbits(SPI_DMA_INT_CLR_REG(priv->config->id),
                          SPI_TRANS_DONE_INT_CLR_M);
  nxsem_post(&priv->sem_isr);

  return 0;
}
#endif

/****************************************************************************
 * Name: esp32s3_spibus_initialize
 *
 * Description:
 *   Initialize the selected SPI bus.
 *
 * Input Parameters:
 *   port - Port number (for hardware that has multiple SPI interfaces)
 *
 * Returned Value:
 *   Valid SPI device structure reference on success; NULL on failure.
 *
 ****************************************************************************/

struct spi_dev_s *esp32s3_spibus_initialize(int port)
{
  struct spi_dev_s *spi_dev;
  struct esp32s3_spi_priv_s *priv;

  switch (port)
    {
#ifdef CONFIG_ESP32S3_SPI2
      case ESP32S3_SPI2:
        priv = &esp32s3_spi2_priv;
        break;
#endif
#ifdef CONFIG_ESP32S3_SPI3
      case ESP32S3_SPI3:
        priv = &esp32s3_spi3_priv;
        break;
#endif
      default:
        return NULL;
    }

  spi_dev = (struct spi_dev_s *)priv;

  nxmutex_lock(&priv->lock);
  if (priv->refs != 0)
    {
      priv->refs++;
      nxmutex_unlock(&priv->lock);
      return spi_dev;
    }

