apache/nuttx/arch/xtensa/src/esp32s3/esp32s3_spi.c
#ifdef CONFIG_ESP32S3_SPI_DMA
  /* If a CPU Interrupt was previously allocated, then deallocate it */

  if (priv->cpuint != -ENOMEM)
    {
      /* Disable the provided CPU Interrupt to configure it. */

      up_disable_irq(priv->config->irq);
      esp_teardown_irq(priv->config->periph, priv->cpuint);

      priv->cpuint = -ENOMEM;
      priv->cpu = -ENODEV;
    }

  /* Set up to receive peripheral interrupts on the current CPU */

  priv->cpu = this_cpu();
  priv->cpuint = esp_setup_irq(priv->config->periph,
                               ESP32S3_INT_PRIO_DEF,
                               ESP_IRQ_TRIGGER_LEVEL,
                               esp32s3_spi_interrupt,
                               priv);
  if (priv->cpuint < 0)
    {
      /* Failed to allocate a CPU interrupt of this type. */

      nxmutex_unlock(&priv->lock);
      return NULL;
    }

  /* Enable the CPU interrupt that is linked to the SPI device. */

  up_enable_irq(priv->config->irq);
#endif

  if (esp32s3_spi_init(spi_dev) != OK)
    {
#ifdef CONFIG_ESP32S3_SPI_DMA
      up_disable_irq(priv->config->irq);
      esp_teardown_irq(priv->config->periph, priv->cpuint);
      priv->cpuint = -ENOMEM;
#endif
      nxmutex_unlock(&priv->lock);
      return NULL;
    }

  priv->refs++;

  nxmutex_unlock(&priv->lock);
  return spi_dev;
}

/****************************************************************************
 * Name: esp32s3_spibus_uninitialize
 *
 * Description:
 *   Uninitialize an SPI bus.
 *
 * Input Parameters:
 *   dev - Device-specific state data
 *
 * Returned Value:
 *   Zero (OK) is returned on success. Otherwise -1 (ERROR).
 *
 ****************************************************************************/

int esp32s3_spibus_uninitialize(struct spi_dev_s *dev)
{
  struct esp32s3_spi_priv_s *priv = (struct esp32s3_spi_priv_s *)dev;

  DEBUGASSERT(dev);

  if (priv->refs == 0)
    {
      return ERROR;
    }

  nxmutex_lock(&priv->lock);
  if (--priv->refs != 0)
    {
      nxmutex_unlock(&priv->lock);
      return OK;
    }

#ifdef CONFIG_ESP32S3_SPI_DMA
  up_disable_irq(priv->config->irq);
  esp_teardown_irq(priv->config->periph, priv->cpuint);

  priv->cpuint = -ENOMEM;

#endif

  esp32s3_spi_deinit(dev);
  nxmutex_unlock(&priv->lock);

  return OK;
}

#endif /* CONFIG_ESP32S3_SPI */
